Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: སྤོབས་པ་རྒྱུན་མི་འཆད་པའི་རྒྱུ་རབ་ཏུ་འཛིན་པར་འགྱུར་བ་དང་། སྐྱེ་བོ་མཁས་པས་གཡོག་བྱས་པར་འགྱུར་བ་དང་། ཤེས་རབ་ཆེན་པོའི་རྒྱུ་རབ་ཏུ་འཛིན་པར་འགྱུར་བ་དང་། མྱུར་དུ་ཆོས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པར་འགྱུར་བ་དང་།
en: (27) They will acquire the cause of uninterrupted eloquence. (28) They will be served by wise beings. (29) They will acquire the cause of great insight. (30) They will quickly attain the light of the Dharma.

source: དེའི་སེམས་ལ་ཚུལ་བཞིན་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་པ་ཀུན་ཏུ་མི་འབྱུང་བ་དང་།
en: (31) Improper contemplation will not arise in their minds.

source: འཇིག་རྟེན་གྱི་ཟང་ཟིང་གི་སྦྱིན་པ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས་དེ་ཆོས་ཀྱི་གཏེར་ཟད་མི་ཤེས་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་སྟེ།
en: (32) They will surpass all forms of mundane generosity related to material things and acquire the inexhaustible Dharma treasure.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་ན་ཡོན་ཏན་གྱི་ཁྱད་པར་ཡང་དག་ཕུལ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་ཐོབ་པར་འགྱུར་རོ། །
en: Ānanda, if bodhisattvas practice generosity with the Dharma, they will acquire those thirty-two excellent and extraordinary qualities.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, Śakra, lord of the gods, said to the Blessed one,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཟུང་ལགས་ཏེ།
en: “Blessed One, I will also uphold this Dharma teaching!

source: བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སླད་ན་སེམས་ཅན་སྣོད་དུ་གྱུར་པ་དེ་དག་གི་རྣ་ལམ་དུ་བསྒྲག་པར་བགྱི། ཀུན་བསྲུང་བར་བགྱི། མོས་པར་བགྱི།
en: After the Blessed One has passed into nirvāṇa, I will ensure that beings who are proper recipients hear it. I will guard them and ensure that they have faith in it.

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་འདི་དང་བསོད་ནམས་ཡོངས་སུ་འཛིན་པ་དོན་དུ་གཉེར་བའི་སླད་དུའོ། །
en: Because, Blessed One, I am pursuing those excellent qualities and the accumulation of merit.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་གནང་སྟེ།
en: At that moment, the Blessed One applauded Śakra, lord of the gods.

source: ཀཽ་ཤི་ཀ་ཁྱོད་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ངའི་མདུན་དུ་སེང་གེའི་སྒྲ་བསྒྲགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: He said, “Kauśika, the lion’s roar by which you have vowed in front of me to uphold the sacred Dharma is excellent, excellent!

source: ཀཽ་ཤི་ཀ་དགེ་བའི་རྩ་བ་འདི་ངའི་དམ་པའི་ཆོས་ཡུན་ཇི་སྲིད་དུ་གནས་པ་དེ་སྲིད་དུ་ལྷ་དང་ལྷ་མ་ཡིན་གཡུལ་འགྱེད་པ་ན་ལྷ་མ་ཡིན་རྣམས་ནི་ཕམ་པར་འགྱུར་ལྷ་རྣམས་ནི་རྒྱལ་བར་འགྱུར་རོ། །
en: Kauśika, as long as my sacred Dharma endures, whenever the gods and the demigods are fighting, this root of virtue will cause the demigods to be defeated and the gods to be victorious in battle.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཡང་དག་ཕུལ་ཡིན་ཏེ།
en: This, Kauśika, is due to the fact that this Dharma teaching is excellent.

source: ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མི་དམིགས་པ་དེ་ནི་འཇིགས་པ་མེད་པའི་སྦྱིན་པའོ། །
en: Kauśika, not apprehending any phenomenon is the gift of fearlessness.

source: ཀཽ་ཤི་ཀ་གང་ཅུང་ཟད་འཇིགས་པ་སྐྱེ་བ་དེ་དག་ཐམས་ཅད་ནི་འཇིག་ཚོགས་ལ་ལྟ་བ་ལ་དམིགས་ཤིང་རབ་ཏུ་གནས་པ་ལས་བྱུང་ངོ་། །
en: Kauśika, whenever the slightest fear arises, it invariably originates in apprehending and dwelling on the view of the transitory collection.

source: ཀཽ་ཤི་ཀ་གང་མི་དམིགས་པ་དེ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Kauśika, those who are free from apprehension uphold the sacred Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Brahmā, lord of the Sahā world, then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་བསམ་གཏན་གྱི་བདེ་བ་ལ་གནས་པ་ཚད་མ་མཆིས་པ་བཏང་སྟེ།
en: “Blessed One, I will renounce the limitless modes of dwelling in the bliss of concentration, and

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གང་དང་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རབ་ཏུ་སྤྱོད་པ་དེ་དང་དེ་དག་ཏུ་བདག་ཆོས་ཉན་པའི་སླད་དུ་ཉེ་བར་མཆི་བར་བགྱིའོ། །
en: I will go to listen to the Dharma in all the villages, cities, towns, provinces, countries, and royal capitals where this Dharma teaching is practiced.

source: མཆིས་ནས་ཀྱང་ཆོས་སྨྲ་བ་དེ་དག་ཆོས་དང་ལྡན་པས་བསྲུང་བ་དང་། སྦ་བ་དང་བསྐྱབ་པར་བགྱིའོ། །
en: In those places, I will protect, guard, and support all those who preach the Dharma rightfully.

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམས་ནི་འདི་ལས་བྱུང་བའི་སླད་དུའོ། །
en: Because, Blessed One, the hearers, the solitary buddhas, Śakra, Brahmā, the protectors of the world, and the universal monarchs originate from this Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The four great kings then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་བདག་ཅག་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་བདག་ཅག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་བསྲུང་བ་དང་སྦ་བ་དང་བསྐྱབ་པ་ལ་བརྩོན་པར་བགྱིའོ། །
en: “Blessed One, we, the four great kings, and the great hearers of the Blessed One, will strive to protect, guard, and support this Dharma teaching to ensure that it endures for a long time.

source: བདག་ཅག་གི་འཁོར་གང་དག་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མ་དད་པ་དེ་དག་ཀྱང་ཇི་ནས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་བསྲུང་བའི་སླད་དུ་བརྩོན་པར་འགྱུར་བར་དད་པར་བགྱིའོ། །
en: Our retinues will ensure that those who do not trust the Buddha and his teachings develop faith and exert themselves for the sake of protecting the teaching of the Thus-Gone One.

source: བཅོམ་ལྡན་འདས་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་གང་དག་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་བརྩོན་པ་དང་། གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་དད་པ་སྲུང་བ་མཆིས་པ་དེ་དག་སྲུང་བའི་ཆེད་དུ་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་ལ་ཁ་ཏོན་དུ་བགྱིའོ། །གསང་སྔགས་ཀྱི་ཚིག་དེ་དག་གིས་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུལ་བུམ་ལ་སོགས་པ་དང་། མི་དང་མི་མ་ལགས་པ་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་ཞེ་སྡང་བར་བགྱིད་པ་རྣམས་ཤིན་ཏུ་ཚར་གཅོད་པར་འགྱུར་རོ། །
en: Blessed One, we will now recite the following secret mantra words to protect the monks, nuns, and male and female lay practitioners who exert themselves in the teachings of the Buddha, as well as those who trust and guard the teaching of the Blessed One. These secret mantra words will subjugate beings such as yakṣas, rākṣasas, gandharvas, kiṃnaras, mahoragas, and kumbhāṇḍas, as well as humans, nonhumans, and all those who are hostile toward the teaching of the Buddha:

source: !ཏརྱ་ཐཱ། ཏ་ར་བེ། ཨ་ར་བེ། ཨ་ནོ་པེ། ས་ར་པེ། ཧུ་ལུ་མ་ཧཱ་ཧུ་ལུ། ཧུ་ལུ་ཧུ་ལུ། ཨ་བད་ཊེ། བི་ཀད་ཊེ། པ་རི་ཙྪེ་དཱ་ནི། ནི་གྲྀ་ཧྞི་ཏེ། པྲ་གྷཱ་ཏ་ནི། ཨིད་ཊི་ཨིད་ཊི། བིད་ཊི་བིད་ཊི། ཨད་ཚེ་གད་ཚེ། མཱ་ར་ནི་གྲ་ཧ་ན། སརྦ་པ་ར་པྲ་བཱ་དི་ནི་གྲ་ཧ་ན། སརྦ་མི་ཐྱ་པྲ་ཡཱ་ཏཱ་ནན་ནི་གྲ་ཧ་ན། སརྦ་བྷཱུ་ཏ་གྲ་ཧཱན། བུད་དྷ་བར་ཎི་ཏ་དྷརྨ་ནི་ཡ་ཏ་ཤཱ་ཡ་བྷུ་ཏན། བུད་དྷ་བར་ཎི་ཏཱན། ཙ་ཏུར་མ་ཧཱ་རཱ་ཛ་ནི་རྡེ་ཤཱན། མནྟྲ་བ་ལཱན། ཨ་བ་ཏཱ་ར། པྲེཀྵི་ཎཱ་ནི་གྲ་ཧཱ་ཡ།
en: Tadyathā: tarabe arabe anobe sarabe hulu mahāhulu hulu hulu āvaṭṭe vikaṭṭe paricchedani nigṛhṇati praghātani iṭṭi iṭṭi viṭṭi viṭṭi acche gacche māranigrahaṇa sarvaparapravādinigrahaṇa sarvamithyāprayātānanigrahaṇa sarvabhūtanigrahaṇa buddhavarṇitā dharmaniyataśaya ayaṃ bhūtan buddhavarṇitan caturmahārājanirdeśana mantrabalān avatāra prekṣiṇānigrahāya

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་ལ་བཀའ་སྩལ་པ།
en: Then, the Blessed One said to the bodhisattvas Maitreya and Divyamauli,

source: སྐྱེས་བུ་དམ་པ་དག་ངས་བསྐལ་པ་མཐའ་ཡས་གྲངས་མེད་པར་ཡང་དག་པར་བསྒྲུབས་པའི་བྱང་ཆུབ་འདི་ཇི་ནས་ཡུན་རིང་དུ་གནས་པར་འགྱུར་བ་དང་ནུབ་པར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཁྱེད་གཉིས་ཀྱི་ལག་ཏུ་བཞག་གོ་གཏད་དོ། །
en: “Sublime beings, I entrust and place in your hands this awakening that I have accomplished over countless eons, to ensure that it endures for a long time without vanishing.”

source: དེ་གཉིས་ཀྱིས་གསོལ་པ།
en: They both replied,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སླད་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བགྱིའོ། །རྒྱས་པར་བགྱིའོ། །
en: “Blessed One, after the Blessed One has passed into nirvāṇa, we shall both uphold and propagate this Dharma teaching.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཆོས་སྨྲ་བ་དང་། དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་ལག་ཏུ་མཆི་བར་བགྱིའོ། །
en: We shall place this Dharma teaching in the hands of those who teach the Dharma and those noble sons and daughters who have created roots of virtue.

source: དེ་དག་མདོ་སྡེ་འདི་ལ་མོས་པར་བགྱི་བ་དང་ཡོངས་སུ་འཛིན་པར་བགྱི་བའི་སླད་དུ་དེ་དག་གི་ཡིད་རབ་ཏུ་གཟུང་བར་བགྱིའོ། །
en: We shall look after them to make sure that they trust and uphold this discourse.

source: བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གི་རྣ་ལམ་དུ་ཐོས་པ་དང་། ཐོས་ནས་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། འཆང་བ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱི་བྱིན་གྱི་རླབས་ལེགས་པར་རིག་པར་བགྱིའོ། །
en: Blessed One, in the future, when beings hear this Dharma teaching and keep it in mind, hold it, read it, comprehend it, and carry it, it will be known to be due to the blessings of the bodhisattvas Maitreya and Divyamauli.”

source: དེ་ནས་བདུད་སྡིག་ཅན་འཁོར་དེར་འདུས་པར་གྱུར་ནས་འདུག་པ་དེ་གདོང་ལས་མཆི་མ་ཟག་ཅིང་ང་རོ་ཕྱུང་ནས་
en: At that moment, the evil Māra, who was present in the assembly, started to shed tears and wail.

source: བཅོམ་ལྡན་འདས་གང་བཅོམ་ལྡན་འདས་ཀྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལས་བརྩམས་ཏེ། ཆོས་བསྟན་པ་ལ་ནི་བདག་ཐ་ན་སྤུ་ཟིང་ཞེས་བགྱིད་པ་ཙམ་ཡང་མ་མཆིས་སོ། །
en: “Blessed One, your Dharma teachings, starting with the vehicle of the hearers, have never ever given me goosebumps.

source: གང་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཕྱག་རྒྱ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཀྱི་ལམ་ལ་འཇུག་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟོན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གསུངས་པ་དེས་བདག་མྱ་ངན་གྱི་ཟུག་རྔུ་དང་ལྡན་ཞིང་བདག་ཉིད་རྙིས་པར་གྱུར་པ་སྙམ་བགྱིད་དོ། །
en: However, this Dharma teaching that the Blessed One has taught—the seal of the bodhisattvas blessed by the thus-gone ones, the entrance to the path of awakening of all bodhisattvas, the support for all beings—has caused me such painful misery and made me weak!

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཕྱག་བརྐྱང་བ་བསྩལ་དུ་གསོལ།
en: Blessed One, please reach out to me!

source: གང་ཐོས་པས་བདག་མྱ་ངན་གྱི་ཟུག་རྔུ་དང་ལྡན་པར་འགྱུར་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་ཡང་མི་གསུང་བར་གསོལ།
en: Please stop expounding this Dharma teaching that causes me such painful misery!”

source: སྡིག་ཅན་ཁྱོད་དང་འཐུན་པའི་སེམས་ཅན་ཆོས་ཟབ་མོ་འདི་ལྟ་བུ་ལ་མ་མོས་པ་ནི་མང་། གང་དག་མོས་པའི་སེམས་ཅན་དེ་དག་ནི་ཉུང་གིས། མྱ་ངན་མ་བྱེད་སྨྲེ་སྔགས་མ་འདོན་ཅིག །
en: “Evil One,” “there are many beings like you who do not trust such a profound teaching, and there are only a few who do, so do not be distressed and stop wailing!

source: སྡིག་ཅན་འདི་ལྟ་སྟེ་དཔེར་ན། སའི་སྟེང་ནས་རྡུལ་བླངས་པ་སྙེད་ཀྱི་སེམས་ཅན་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་ཟབ་མོ་འདི་ལྟ་བུ་ལ་མོས་སོ། །
en: Evil One, for example, beings who trust this profound Dharma teaching are as many as a pinch of dust taken from the surface of the earth, while

source: སའི་རྡུལ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་ཟབ་མོ་འདི་ལ་མ་མོས་ཏེ།
en: beings who are not devoted to this profound Dharma teaching are as numerous as all the particles of dust on the entire earth.

source: དེ་དག་ཐམས་ཅད་ནི་ཁྱོད་དང་འཐུན་ནོ། །
en: All those beings are like you;

source: སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ཁྱོད་དང་འཐུན་གྱིས་དེ་བས་ན་སྡིག་ཅན་དགའ་བར་གྱིས་ཤིག །
en: all the beings from innumerable realms are like you, so you should be happy, Evil One!”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ནི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་སོ། །
en: When this Dharma teaching was delivered, countless beings set out for awakening,

source: བྱང་ཆུབ་སེམས་དཔའ་དགུ་ཁྲི་ཉིས་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: ninety-two thousand bodhisattvas reached acceptance of the unborn nature of phenomena,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: eighty-four thousand beings purified the spotless and stainless Dharma eye with respect to phenomena, and

source: དགེ་སློང་བརྒྱད་སྟོང་ནི་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: the minds of eight thousand monks became free from defilements without any further appropriation.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ནས་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏེ།
en: This great trichiliocosm shook in six ways and was bathed in a dazzling light.

source: ལྷའི་མེ་ཏོག་གི་ཆར་ནི་རབ་ཏུ་ཕབ།
en: A rain of divine flowers fell from the sky, and

source: སིལ་སྙན་བརྒྱ་སྟོང་དག་ནི་མ་དཀྲོལ་བར་རང་འཁྲོལ་ལོ། །
en: the melodies of hundreds of thousands of instruments resounded everywhere, without anyone playing them.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རྣམས་ནི་སྟེང་གི་བར་སྣང་ལ་ཀྱེ་མ་བདག་ཅག་གིས་འཛམ་བུའི་གླིང་དུ་ཆོས་ཀྱི་འཁོར་ལོ་ལན་གཉིས་བསྐོར་བ་འདི་མཐོང་ངོ་། །
en: Billions of gods residing in the sky exclaimed, “Oh, we have just witnessed a second turning of the wheel of Dharma in Jambudvīpa!

source: བཅོམ་ལྡན་འདས་ཀྱིས་གང་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་ཏེ་བཤད་ནས། སེམས་ཅན་གྱི་དོན་མཛད་པ་གང་ལགས་པ་འདི་ན་གྲོང་ཁྱེར་འཁོར་མོར་འཇིག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དེ་བས་ཆེས་མཆོག་གོ། །
en: The benefit for beings that has been accomplished by the Blessed One revealing and explaining this Dharma teaching is far greater than that of the turning of the Dharma wheel in the city of Vārāṇasī—and the maturation of beings is also greater!

source: གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་སྟོན་པ་དང་། ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེའཆང་བའི་སེམས་ཅན་དེ་དག་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་རོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: All the beings who will retain this Dharma teaching and hold it, read it, comprehend it, fully teach it to others, or even write it down and carry it, will also be turning the wheel of Dharma!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the bodhisattva Maitreya, the bodhisattva Divyamauli, and venerable Ānanda asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: “Blessed One, what is the name of this Dharma teaching? How should it be remembered?”

source: རིགས་ཀྱི་བུ་དག་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་ངེས་པ་བསྟན་པ་དང་། དམ་པའི་ཆོས་རིན་པོ་ཆེའི་ལེའུ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “Noble sons,” “you should remember this Dharma teaching as The Questions of the Kiṃnara King Druma—The Definitive Teaching on the Perfections . You should also remember it as The Precious Chapter on the Sacred Dharma .”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་དགའོ།། །།
en: When the Blessed One had spoken, the bodhisattva Maitreya, the bodhisattva Divyamauli, venerable Ānanda, and the world with its gods, humans, and demigods, rejoiced in the words of the Blessed One and were delighted.

source: འཕགས་པ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the Noble Great Vehicle Sūtra “ The Questions of the Kiṃnara King Druma .”

source: !ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བནྡེ་དཔལ་གྱི་ལྷུན་པོ་དང་། དཔལ་བརྩེགས་ཀྱིས་བསྒྱུར་ཅིང་ས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: Translated, edited, and finalized by the translator-editors venerable Palgi Lhünpo and venerable Paltsek Rakṣita.
